UTAF_Base/requestFiles/BPS_Customer_GetBillingAccountList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v5.customer.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         
         <urn:endUserId>id000000</urn:endUserId>
         
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         
         <urn:propagatedKey>444</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataGetBillingAccountList version="5.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id000000</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>

         <urn1:pageNbr>${Req_pageNbr}</urn1:pageNbr>
         <urn1:partyId>${Req_partyId}</urn1:partyId>        
         <urn1:houseNbr>${Req_houseNbr}</urn1:houseNbr>         
         <urn1:alphaHouseNbr>${Req_alphaHouseNbr}</urn1:alphaHouseNbr>        
         <urn1:streetCode>${Req_streetCode}</urn1:streetCode>         
         <urn1:cityCode>${Req_cityCode}</urn1:cityCode>        
         <urn1:countryIso3Code>${Req_countryIso3Code}</urn1:countryIso3Code>         
         <urn1:snNetworkType>${Req_snNetworkType}</urn1:snNetworkType>         
         <urn1:subscriptionNbr>${Req_subscriptionNbr}</urn1:subscriptionNbr>         
         <urn1:paId>${Req_paId}</urn1:paId>       
        
      </urn1:RequestDataGetBillingAccountList>
   </soapenv:Body>
</soapenv:Envelope>